EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Get.c
  SCDEFn_at_ESP32_DeVICE_M->readings_end_update_fn((Common_Definition_t*) p_ESP32_DeVICE_Definition, true);
  }



















// ------------------------------------------------------------------------------------------------

error2:

// ------------------------------------------------------------------------------------------------

//error1:

  return p_retMsg;
}
















/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Get
 *  Desc: Processes the device-specific command line arguments from the get command
 *  Info: Invoked by cmd-line 'Get ESP32Control_Definition.common.Name getArgs'
 *  Para: ESP32Control_Definition_t *ESP32Control_Definition -> WebIF Definition that should get a set cmd
 *        uint8_t *getArgsText -> the getArgsText
 *        size_t getArgsTextLen -> length of the getArgsText
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_DeVICE_Get(Common_Definition_t* Common_Definition
                ,uint8_t *getArgsText
                ,size_t getArgsTextLen)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
	(Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
	,Common_Definition->nameLen
	,5
	,"GetFn of Module '%.*s' is called for Definition '%.*s'. Definition shall respond to GET arguments '%.*s'."
	,Common_Definition->module->provided->typeNameLen
	,Common_Definition->module->provided->typeName
	,Common_Definition->nameLen
	,Common_Definition->name
	,getArgsTextLen
	,getArgsText);
  #endif	

// -------------------------------------------------------------------------------------------------

  // note: call to _Get Fn is blocked with getArgsTextLen = 0 !

/*
  // note: '?' KEY is not emplemented -> the error-msg is the correct answer !

  // getArgsText '?' -> respond with help
  if ( (getArgsTextLen > 0) && (*getArgsText == 'X') ) {

	// set start of possible Type-Name
	const uint8_t *tempTxt = getArgsText + 1;

	// a seek-counter
	int i = 1;

	// skip spaces after '?' (search for more ...)
	while( (i < getArgsTextLen) && (*tempTxt == ' ') ) {i++;tempTxt++;}


	// only spaces after '?' -> answer with get-Capabilities
	if (i == getArgsTextLen) {

		// response with error text
		// alloc mem for retMsg
		retMsg = malloc(sizeof(strTextMultiple_t));

		// response with error text
		retMsg->strTextLen = asprintf(&retMsg->strText
			,"requested ? '%.*s' ! This will be removed..."
			,getArgsTextLen
			,getArgsText);

		return retMsg;

		}
	// '? + X' here !!! -> normal parse -> will throw error in next step
	}
*/
// ------------------------------------------------------------------------------------------------

  char **argv;
  int argc;

  // split 'getArgsText' the default way
  argv = SCDEFn_at_ESP32_DeVICE_M->ArgParse_SplitArgsToAllocatedMemFn(&argc, getArgsText, getArgsTextLen);

  retMsg = (strTextMultiple_t*) ESP32_DeVICE_GetV2(Common_Definition
                ,argv, argc);


  // ArgParseFn has allocated mem. Free it.
  SCDEFn_at_ESP32_DeVICE_M->ArgParse_FreeSplittedArgsInAllocatedMemFn(argv);

// ------------------------------------------------------------------------------------------------

  return retMsg;
}



